//Выведите с помощью цикла столбец чисел от 1 до 100. Показать решение.
let array = [];
for(let i = 0; i<=100; i++){
    console.log(i)
}

//Выведите с помощью цикла столбец чисел от 100 до 1. Показать решение.
let array2 = [];
for(let i = 100 -1; i>0; i++){
    console.log(i)
}

//Выведите с помощью цикла столбец четных чисел от 1 до 100. Показать решение.


//Заполните массив 10-ю иксами с помощью цикла. Показать решение.

//Заполните массив числами от 1 до 10 с помощью цикла. Показать решение.

//Заполните массив 10-ю случайными числами (дробями) от 0 до 1 с помощью цикла. Дроби округляйте до двух знаков в дробной части. Показать решение.

//Заполните массив 10-ю случайными числами от 1 до 10 с помощью цикла. Показать решение.

//Дан массив с числами. С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти. Показать решение.


